package ch02.sec01;

public class PrimitiveType {
    /*
    기본(원시) 타입 (Primitive Type) - 총 8개
    정수: ( byte(1), short(2) 잘안쓴다 ) int(4), long(8) PK를 줄때 사용함 CPU처리는 4바이트
    실수: float(4), double(8)
    문자: char(2)
    논리: boolean(1)

    모두 타입명이 소문자로 구성

    byte -128~ 127 양수로만 따지면 256

    23 (10진수) > 10111(2진수)
    2 / 23  몫 11 나머지 1 /2 = 몫 5 나머지 1 /2 = 몫 2 나머지 1 /2 = 몫 1 나머지 0
    10111(2진수)>
    2의 4제곱 2의 3제곱 2의 2제곱 2의 1제곱 2의 0제곱
       1        0        1         1        1
     16    +    0   +    4  +      2   +    1
                20        +         3

    16 (10 진수) > 10000
    1010101(2진수) > 85 (10진수)

    23(10진수)>(8진수)027
    55(10진수) > (8진수) 067




     */
}
